src/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СброситьПараметрыВыбора()
	Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
	Элементы.Заказ.СвязиПараметровВыбора   = Новый ФиксированныйМассив(Новый Массив);
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
	Заказ = Объект.Заказ;
	Если ЗначениеЗаполнено(Заказ) Тогда
		Объект.Контрагент = Заказ.Поставщик;
		Объект.Сумма 	  = Заказ.ОбщаяСтоимость;
		Объект.Договор	  = РасчетыКлиентСервер.ПолучитьДоговорНаСервере(Заказ);
		Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
			Массив = Новый Массив(1);
			Массив[0] = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
			Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		КонецЕсли; 
	Иначе
		СброситьПараметрыВыбора();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.Договор = РасчетыКлиентСервер.ПолучитьДоговорНаСервере(Объект.Контрагент);
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Массив = Новый Массив(1);
		Массив[0] = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
		Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		
		Массив[0] = Новый СвязьПараметраВыбора("Отбор.Поставщик", "Объект.Контрагент");
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			Массив.Добавить(Новый СвязьПараметраВыбора("Отбор.Договор", "Объект.Договор"));
		КонецЕсли; 
		Элементы.Заказ.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
	Иначе
		СброситьПараметрыВыбора();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Если Объект.Заказ.Договор <> Объект.Договор Тогда
		Объект.Заказ = Документы.ЗаказПоставщику.ПустаяСсылка();
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.Контрагент = Объект.Договор.Владелец;
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Массив = Новый Массив(1);
			Массив[0] = Новый СвязьПараметраВыбора("Отбор.Договор", "Объект.Договор");
			Элементы.Заказ.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
 

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
